mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xj/s6e2c1xj.svd
        <!-- REGISTER "IRQ124MON" -->
        <register>
          <name>IRQ124MON</name>
          <description>IRQ124 Batch Read Register [BHW]</description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT14_RX" -->
            <field>
              <name>MFSINT14_RX</name>
              <description>Reception interrupt request of the MFS ch.14</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ125MON" -->
        <register>
          <name>IRQ125MON</name>
          <description>IRQ125 Batch Read Register [BHW]</description>
          <addressOffset>0x3F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT14_STATUS" -->
            <field>
              <name>MFSINT14_STATUS</name>
              <description>Status interrupt request of the MFS ch.14</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT14_TX" -->
            <field>
              <name>MFSINT14_TX</name>
              <description>Transmission interrupt request of the MFS ch.14</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ126MON" -->
        <register>
          <name>IRQ126MON</name>
          <description>IRQ126 Batch Read Register [BHW]</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT15_RX" -->
            <field>
              <name>MFSINT15_RX</name>
              <description>Reception interrupt request of the MFS ch.15</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ127MON" -->
        <register>
          <name>IRQ127MON</name>
          <description>IRQ127 Batch Read Register [BHW]</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT15_STATUS" -->
            <field>
              <name>MFSINT15_STATUS</name>
              <description>Status interrupt request of the MFS ch.15</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT15_TX" -->
            <field>
              <name>MFSINT15_TX</name>
              <description>Transmission interrupt request of the MFS ch.15</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DAC0" -->
    <peripheral>
      <name>DAC0</name>
      <description>D/A Converter 0</description>
      <version>A</version>
      <groupName>DAC</groupName>
      <baseAddress>0x40033000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DACR" -->
        <register>
          <name>DACR</name>
          <description>D/A Control Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DDAS" -->
            <field>
              <name>DDAS</name>
              <description>10-bit mode data allocation selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DAC10" -->
            <field>
              <name>DAC10</name>
              <description>10-bit mode</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRDY" -->
            <field>
              <name>DRDY</name>
              <description>D/A converter operation enable state bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DAE" -->
            <field>
              <name>DAE</name>
              <description>D/A converter operating enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DADR" -->
        <register>
          <name>DADR</name>
          <description>D/A Data Register [HW]</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DA" -->
            <field>
              <name>DA</name>
              <description>D/A Data Register</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
